In [2]:
from pydataset import data

1. Copy the code from the lesson to create a dataframe full of student grades.

In [3]:
import pandas as pd
import numpy as np

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

1a. Create a column named passing_english that indicates whether each student has a passing grade in reading.

In [4]:
df['passing_english'] = reading_grades > 60
df.head()

    name  math  english  reading  passing_english
0  Sally    62       85       80             True
1   Jane    88       79       67             True
2  Suzie    94       74       95             True
3  Billy    98       96       88             True
4    Ada    77       92       98             True

1b. Sort the english grades by the passing_english column. How are duplicates handled?

In [5]:
df.sort_values(by='passing_english').head()
# Duplicates are not being handled

    name  math  english  reading  passing_english
0  Sally    62       85       80             True
1   Jane    88       79       67             True
2  Suzie    94       74       95             True
3  Billy    98       96       88             True
4    Ada    77       92       98             True

1c. Sort the english grades first by passing_english and then by student name. 

All the students that are failing english should be first, and within the students that are failing english they should be ordered alphabetically. 
The same should be true for the students passing english. 
(Hint: you can pass a list to the .sort_values method)

In [6]:
df.sort_values(by=['passing_english', 'name']).head()

      name  math  english  reading  passing_english
4      Ada    77       92       98             True
11    Alan    92       62       72             True
8   Albert    92       62       87             True
3    Billy    98       96       88             True
10   Isaac    92       99       93             True

1d. Sort the english grades first by passing_english, and then by the actual english grade, 
similar to how we did in the last step.

In [7]:
df.sort_values(['passing_english', 'english']).head()

      name  math  english  reading  passing_english
8   Albert    92       62       87             True
11    Alan    92       62       72             True
7    Marie    93       63       90             True
6   Thomas    82       64       81             True
2    Suzie    94       74       95             True

1e. Calculate each students overall grade and add it as a column on the dataframe. 
The overall grade is the average of the math, english, and reading grades.

In [8]:
df['overall_grade'] = (df['english'] + df['math'] + df['reading']) / 3 
df.head()

    name  math  english  reading  passing_english  overall_grade
0  Sally    62       85       80             True      75.666667
1   Jane    88       79       67             True      78.000000
2  Suzie    94       74       95             True      87.666667
3  Billy    98       96       88             True      94.000000
4    Ada    77       92       98             True      89.000000

2. Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:

In [9]:
mpg = data('mpg', show_doc=False)

How many rows and columns are there?

In [10]:
mpg.shape

(234, 11)

What are the data types of each column?

In [11]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
manufacturer    234 non-null object
model           234 non-null object
displ           234 non-null float64
year            234 non-null int64
cyl             234 non-null int64
trans           234 non-null object
drv             234 non-null object
cty             234 non-null int64
hwy             234 non-null int64
fl              234 non-null object
class           234 non-null object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

Summarize the dataframe with .info and .describe

In [12]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
manufacturer    234 non-null object
model           234 non-null object
displ           234 non-null float64
year            234 non-null int64
cyl             234 non-null int64
trans           234 non-null object
drv             234 non-null object
cty             234 non-null int64
hwy             234 non-null int64
fl              234 non-null object
class           234 non-null object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [13]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

Rename the cty column to city.

In [14]:
mpg = mpg.rename(columns={'cty': 'city'})

Rename the hwy column to highway.

In [15]:
mpg = mpg.rename(columns={'hwy': 'highway'})

Do any cars have better city mileage than highway mileage?

In [16]:
mpg['better_city_than_highway_mpg'] = mpg['city'] > mpg['highway']
mpg.sort_values(by='better_city_than_highway_mpg', ascending=True)
mpg.better_city_than_highway_mpg.sum()

0

Create a column named mileage_difference this column should contain the difference between highway and city mileage for each car.

In [17]:
mpg['mileage_difference'] = mpg['highway'] - mpg['city']
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,better_city_than_highway_mpg,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,False,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,False,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,False,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,False,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,False,10

Which car (or cars) has the highest mileage difference?

In [18]:
mpg[mpg['mileage_difference'] == mpg['mileage_difference'].max()]

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,better_city_than_highway_mpg,mileage_difference
107,honda,civic,1.8,2008,4,auto(l5),f,24,36,c,subcompact,False,12
223,volkswagen,new beetle,1.9,1999,4,auto(l4),f,29,41,d,subcompact,False,12

Which compact class car has the lowest highway mileage? The best?

In [19]:
# Lowest highway mileage
mpg[mpg['class'] == 'compact'].sort_values('highway').head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,better_city_than_highway_mpg,mileage_difference
220,volkswagen,jetta,2.8,1999,6,auto(l4),f,16,23,r,compact,False,7

In [20]:
# Highest highway mileage
mpg[mpg['class'] == 'compact'].sort_values('highway', ascending=False).head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,better_city_than_highway_mpg,mileage_difference
213,volkswagen,jetta,1.9,1999,4,manual(m5),f,33,44,d,compact,False,11

Create a column named average_mileage that is the mean of the city and highway mileage.

In [21]:
mpg['average_mileage'] = (mpg['city'] + mpg['highway']) / 2
mpg.head()

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,better_city_than_highway_mpg,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,False,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,False,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,False,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,False,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,False,10,21.0

Which dodge car has the best average mileage? The worst?

In [22]:
dodge = mpg[mpg.manufacturer == 'dodge']
dodge.sort_values('average_mileage', ascending=False).head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,better_city_than_highway_mpg,mileage_difference,average_mileage
38,dodge,caravan 2wd,2.4,1999,4,auto(l3),f,18,24,r,minivan,False,6,21.0

In [23]:
dodge.sort_values('average_mileage', ascending=True).head(1)

,manufacturer,model,displ,year,cyl,trans,drv,city,highway,fl,class,better_city_than_highway_mpg,mileage_difference,average_mileage
70,dodge,ram 1500 pickup 4wd,4.7,2008,8,manual(m6),4,9,12,e,pickup,False,3,10.5

Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

In [24]:
mammals = data('Mammals')
mammals.head()

   weight  speed  hoppers  specials
1  6000.0   35.0    False     False
2  4000.0   26.0    False     False
3  3000.0   25.0    False     False
4  1400.0   45.0    False     False
5   400.0   70.0    False     False

How many rows and columns are there?

In [25]:
mammals.shape

(107, 4)

What are the data types?

In [26]:
mammals.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 107 entries, 1 to 107
Data columns (total 4 columns):
weight      107 non-null float64
speed       107 non-null float64
hoppers     107 non-null bool
specials    107 non-null bool
dtypes: bool(2), float64(2)
memory usage: 2.7 KB

Summarize the dataframe with .info and .describe

In [27]:
mammals.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 107 entries, 1 to 107
Data columns (total 4 columns):
weight      107 non-null float64
speed       107 non-null float64
hoppers     107 non-null bool
specials    107 non-null bool
dtypes: bool(2), float64(2)
memory usage: 2.7 KB

In [28]:
mammals.describe()

            weight       speed
count   107.000000  107.000000
mean    278.688178   46.208411
std     839.608269   26.716778
min       0.016000    1.600000
25%       1.700000   22.500000
50%      34.000000   48.000000
75%     142.500000   65.000000
max    6000.000000  110.000000

What is the the weight of the fastest animal?

In [29]:
mammals['speed'].max()

110.0

What is the overal percentage of specials?

In [30]:
total_mammals = len(mammals)
num_of_specials = mammals.specials.sum()
per_of_specials = num_of_specials / total_mammals
per_of_specials

0.09345794392523364

How many animals are hoppers that are above the median speed? What percentage is this?

In [34]:
median_speed = mammals.speed.median()
above_median_speed_mammals = mammals[mammals['speed'] > median_speed]
hoppers_who_are_fast_bois = above_median_speed_mammals[mammals['hoppers']]
len(hoppers_who_are_fast_bois) / len(mammals) * 1000

/usr/local/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  This is separate from the ipykernel package so we can avoid doing imports until

65.42056074766354